{
  "options_calculator_seo_title": "Options Calculator - P/L, Breakeven & Greeks for Fast Trade Planning",
  "options_calculator_seo_description": "Calculate options P/L, breakeven, Greeks, and risk-reward in seconds. Built for short-term options setups and fast decision-making.",
  "options_calculator_seo_keywords": "options calculator, options P&L calculator, breakeven calculator, options Greeks calculator, risk reward, probability of profit, options strategy calculator",
  "options_calculator_breadcrumb_home": "Home",
  "options_calculator_breadcrumb_current": "Options Calculator",
  "options_calculator_title": "Options Calculator",
  "options_calculator_search_placeholder": "Find...",
  "options_calculator_no_results": "No results found",
  "options_calculator_start_searching": "Start searching...",
  "options_calculator_add_option_leg": "Add Option Leg",
  "options_calculator_save_strategy": "Save Strategy",
  "options_calculator_custom_strategy": "Custom Strategy",
  "options_calculator_table_symbol": "Symbol",
  "options_calculator_table_action": "Action",
  "options_calculator_table_quantity": "Quantity",
  "options_calculator_table_expiration": "Expiration Date",
  "options_calculator_table_strike": "Strike",
  "options_calculator_table_type": "Type",
  "options_calculator_table_price": "Price",
  "options_calculator_profit_loss_chart": "Profit/Loss Chart",
  "options_calculator_trade_information": "Trade Information",
  "options_calculator_option_leg": "Option-Leg",
  "options_calculator_stock": "Stock",
  "options_calculator_current_price": "Current Price",
  "options_calculator_breakeven_price": "Breakeven Price",
  "options_calculator_breakeven_info": "The stock price at which an options position will neither make nor lose money.",
  "options_calculator_trade_details": "Trade Details",
  "options_calculator_cost_of_trade": "Cost of Trade",
  "options_calculator_cost_of_trade_info": "The Cost of Trade refers to the total amount needed to open a position. For options, buying a contract creates a net debit (positive cost), while selling a contract creates a net credit (negative cost).",
  "options_calculator_max_profit": "Maximum Profit",
  "options_calculator_max_profit_info": "Maximum Profit is the highest possible gain from an options position or strategy. For long positions, profit is unlimited for calls and capped for puts (if the stock drops to zero). For short positions, profit is limited to the premium received, achieved if the option expires worthless or is repurchased at a lower price.",
  "options_calculator_max_loss": "Maximum Loss",
  "options_calculator_max_loss_info": "Maximum Loss is the worst possible financial outcome of an options position. For long calls or puts, it's limited to the premium paid. For naked calls, losses can be unlimited due to unlimited upside risk. For naked puts, the maximum loss is the strike price minus the premium if the stock drops to zero. In defined-risk spreads, it's the difference between strike prices minus net premium received or paid.",
  "options_calculator_probability_analysis": "Probability Analysis",
  "options_calculator_pop": "Probability of Profit",
  "options_calculator_pop_info": "The Probability of Profit (PoP) measures the likelihood that a trade will result in a profit at expiration. It is calculated using the Black-Scholes model and implied volatility derived from option prices. This metric provides an estimate of the success rate for a given strategy under current market conditions.",
  "options_calculator_pop_max_profit": "Prob. of Max Profit",
  "options_calculator_pop_max_profit_info": "The Probability of Maximum Profit represents the likelihood that a trade will achieve its highest possible profit at expiration. This metric considers factors such as the behavior of the underlying asset, time to expiration, and market volatility (implied volatility derived from option prices).",
  "options_calculator_pop_max_loss": "Prob. of Max Loss",
  "options_calculator_pop_max_loss_info": "The Probability of Maximum Loss represents the likelihood that a trade will incur its worst possible outcome at expiration. This metric helps traders understand the risk of losing their entire investment or facing maximum exposure based on the strategy. It is calculated using the Black-Scholes model.",
  "options_calculator_risk_reward": "Risk Reward Analysis",
  "options_calculator_ev": "Expected Value (EV)",
  "options_calculator_ev_info": "The Expected Value (EV) is the weighted average of all possible outcomes of an options trade, where each payoff at a possible ending price is multiplied by its probability of occurring, and then each resulting value is summed together. It is based on the probability distribution of the security's prices at a future date. This statistical measure helps traders assess the theoretical profitability of a strategy if it were to be repeated many times.",
  "options_calculator_expected_return": "Expected Return",
  "options_calculator_expected_return_info": "The ratio of Expected Value (EV) divided by Maximum Risk, expressed as a percentage. This metric shows the expected profit or loss relative to the maximum potential loss of the trade. For example, if a trade has an Expected Value of $100 and a Maximum Risk of $1,000, the Expected Return would be 10%. This standardized measurement helps traders compare different strategies regardless of position size or structure, providing a risk-adjusted way to evaluate trading opportunities.",
  "options_calculator_reward_risk": "Reward/Risk",
  "options_calculator_reward_risk_info": "The Reward/Risk Percentage measures the potential profit of a trade relative to its potential loss, expressed as a percentage. It is calculated as Maximum Profit divided by Maximum Loss. For example, if a trade has a max profit of $500 and max loss of $200, the Reward/Risk is 250%. This helps traders evaluate whether the potential rewards justify the risks taken on a particular trade. A higher percentage indicates more favorable risk-reward.",
  "options_calculator_greeks": "Position Greeks",
  "options_calculator_delta": "Delta (Δ)",
  "options_calculator_delta_info": "Delta measures how much the value of your trade position will change for every $1 move in the underlying stock. For example, a delta of 50 means your position will gain $50 if the stock rises $1, or lose $50 if it falls $1. Positive delta = bullish exposure, negative delta = bearish exposure.",
  "options_calculator_gamma": "Gamma (Γ)",
  "options_calculator_gamma_info": "Gamma indicates how quickly Delta changes with each $1 move in the underlying asset. High gamma means your delta will change rapidly as the stock moves. Gamma is highest for at-the-money options near expiration. Positive gamma benefits from large moves, negative gamma is hurt by them.",
  "options_calculator_theta": "Theta (Θ)",
  "options_calculator_theta_info": "Theta measures your position's daily loss in value due to time decay. A theta of -$50 means your position loses $50 per day just from the passage of time, assuming all else stays constant. Option buyers have negative theta (time works against them), while sellers have positive theta.",
  "options_calculator_vega": "Vega (ν)",
  "options_calculator_vega_info": "Vega measures the amount the position will change for every 1% change in implied volatility. A vega of $100 means your position will gain $100 if IV rises by 1%, or lose $100 if IV falls by 1%. Long options have positive vega, short options have negative vega.",
  "options_calculator_toast_max_legs": "You've reached the maximum number of option legs.",
  "options_calculator_toast_one_leg_required": "At least one option leg is required!",
  "options_calculator_toast_upgrade_pro": "Upgrade to Pro to unlock this feature!",
  "options_calculator_toast_saved": "Options Strategy saved!",
  "options_calculator_strategy_long_call": "Long Call",
  "options_calculator_strategy_long_put": "Long Put",
  "options_calculator_strategy_short_call": "Short Call",
  "options_calculator_strategy_short_put": "Short Put",
  "options_calculator_strategy_cash_secured_put": "Cash Secured Put",
  "options_calculator_strategy_bull_call_spread": "Bull Call Spread",
  "options_calculator_strategy_bull_put_spread": "Bull Put Spread",
  "options_calculator_strategy_bear_call_spread": "Bear Call Spread",
  "options_calculator_strategy_bear_put_spread": "Bear Put Spread",
  "options_calculator_strategy_long_straddle": "Long Straddle",
  "options_calculator_strategy_short_straddle": "Short Straddle",
  "options_calculator_strategy_long_call_butterfly": "Long Call Butterfly",
  "options_calculator_sentiment_bullish": "Bullish",
  "options_calculator_sentiment_bearish": "Bearish",
  "options_calculator_sentiment_neutral": "Neutral",
  "options_calculator_per_day": "/day"
}
